src/config/Documents/КорректировкаСтоимостиСписанияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>КорректировкаСтоимостиСписанияТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДопРасходыНаПриобретениеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровПереданные</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиСебестоимость</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СкорректированныеКопейки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОприходования</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПартии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗАказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ПартииТоваровПереданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровПереданные</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПолученияПередачиТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровОтданныхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/КорректировкаСтоимостиСписанияТоваров/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДатаНач = НачалоМесяца(Дата);
	ДатаКон = КонецМесяца(Дата);
	
	// Распределение за месяц
	ВыполнитьРаспределениеДопРасходов(НачалоМесяца(Дата), КонецМесяца(Дата), , Ссылка, Дата);
	
	// Усреднение стоимости списания
	ТаблицаТоваров = Новый ТаблицаЗначений;
	
	текСтатусПартии = Перечисления.СтатусыПартийТоваров.ПустаяСсылка();
	текНоменклатураНаименование = "";
	текДокументОприходованияДата = '00010101';
	текДокументОприходования = Неопределено;
	
	// Возьмем движения списания по 100
	КоличествоСтрокЗаПроход=100;
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	Пока Истина Цикл
		МассивТаблиц= Новый Массив;
		
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("СтатусПартии", текСтатусПартии);
		Запрос.УстановитьПараметр("НоменклатураНаименование", текНоменклатураНаименование);
		Запрос.УстановитьПараметр("ДокументОприходованияДата", текДокументОприходованияДата);
		Запрос.УстановитьПараметр("ДокументОприходования", текДокументОприходования);
		
		ТекстЗапросаСклад = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	НаСкладах.Номенклатура КАК Номенклатура,
		|	НаСкладах.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	НаСкладах.СтатусПартии КАК СтатусПартии,
		|	НаСкладах.ДокументОприходования КАК ДокументОприходования,
		|	НаСкладах.ДокументОприходования.Дата КАК ДокументОприходованияДата
		|ИЗ
		|	РегистрНакопления.ПартииТоваровНаСкладах КАК НаСкладах
		|
		|ГДЕ
		|	НаСкладах.Период МЕЖДУ &ДатаНач И &ДатаКон И
		|	(НаСкладах.Номенклатура.Наименование > &НоменклатураНаименование ИЛИ НаСкладах.Номенклатура.Наименование = &НоменклатураНаименование И НаСкладах.СтатусПартии > &СтатусПартии ИЛИ НаСкладах.Номенклатура.Наименование = &НоменклатураНаименование И НаСкладах.СтатусПартии = &СтатусПартии И НаСкладах.ДокументОприходования.Дата > &ДокументОприходованияДата ИЛИ НаСкладах.Номенклатура.Наименование = &НоменклатураНаименование И НаСкладах.СтатусПартии = &СтатусПартии И НаСкладах.ДокументОприходования.Дата = &ДокументОприходованияДата И НаСкладах.ДокументОприходования > &ДокументОприходования) И
		|	НаСкладах.ВидДвижения = &ВидДвижения
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураНаименование,
		|	СтатусПартии,
		|	ДокументОприходованияДата,
		|	ДокументОприходования
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.Текст = ТекстЗапросаСклад;
		
		МассивТаблиц.Добавить(Запрос.Выполнить().Выгрузить());
		
		ТекстЗапросаПереданные = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	Переданные.Номенклатура КАК Номенклатура,
		|	Переданные.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	Переданные.СтатусПартии КАК СтатусПартии,
		|	Переданные.ДокументОприходования КАК ДокументОприходования,
		|	Переданные.ДокументОприходования.Дата КАК ДокументОприходованияДата
		|ИЗ
		|	РегистрНакопления.ПартииТоваровПереданные КАК Переданные
		|
		|ГДЕ
		|	Переданные.Период МЕЖДУ &ДатаНач И &ДатаКон И
		|	(Переданные.Номенклатура.Наименование > &НоменклатураНаименование ИЛИ Переданные.Номенклатура.Наименование = &НоменклатураНаименование И Переданные.СтатусПартии > &СтатусПартии ИЛИ Переданные.Номенклатура.Наименование = &НоменклатураНаименование И Переданные.СтатусПартии = &СтатусПартии И Переданные.ДокументОприходования.Дата > &ДокументОприходованияДата ИЛИ Переданные.Номенклатура.Наименование = &НоменклатураНаименование И Переданные.СтатусПартии = &СтатусПартии И Переданные.ДокументОприходования.Дата = &ДокументОприходованияДата И Переданные.ДокументОприходования > &ДокументОприходования) И
		|	Переданные.ВидДвижения = &ВидДвижения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Наименование,
		|	СтатусПартии,
		|	ДокументОприходованияДата,
		|	ДокументОприходования
		|";
		
		Запрос.Текст = ТекстЗапросаПереданные;
		
		МассивТаблиц.Добавить(Запрос.Выполнить().Выгрузить());
		
		Таблица = Новый ТаблицаЗначений;
		
		// После упорядочивания по датам строки должны располагаться в том же порядке, что и в исходном запросе
		// для этого в служебной колонке запомним порядок запроса (таблицы в массиве) и положение строки в запросе в виде 
		// ПорядокТаблицыВМассиве*10^N + ПорядокВТаблице, где N - количество десятичных разрядов в числе КоличествоСтрокЗаПроход.
		СдвигРазряда = Pow(10,Цел(Log10(КоличествоСтрокЗаПроход)+1));
		
		Таблица.Колонки.Добавить("Ключ"); // Исходный индекс строки
		
		// Создаем колонки
		Для Каждого Колонка Из МассивТаблиц[0].Колонки Цикл
			Таблица.Колонки.Добавить(Колонка.Имя);
		КонецЦикла;
		
		// Загрузим значения в одну таблицу
		Сч=0;
		Для Каждого Элемент Из МассивТаблиц Цикл
			
			Сч=Сч+1;
			
			Для Каждого Строка Из Элемент Цикл
				
				НоваяСтрока = Таблица.Добавить();
				
				Для Каждого Колонка Из Элемент.Колонки Цикл
					Если ПустаяСтрока(Колонка.Имя) ИЛИ Колонка.Имя = "QuieryId" Тогда
						Продолжить;
					КонецЕсли; 
					
					НоваяСтрока[Колонка.Имя] = Строка[Колонка.Имя];
				КонецЦикла;
				
				НоваяСтрока.Ключ=Сч*СдвигРазряда+Элемент.Индекс(Строка);
			КонецЦикла;
		КонецЦикла; 
		
		Таблица.Колонки.Добавить("МоментВремени", Новый ОписаниеТипов("МоментВремени"));
		Для каждого Строка Из Таблица Цикл
			Строка.МоментВремени = Новый МоментВремени(Строка.ДокументОприходованияДата, Строка.ДокументОприходования);
		КонецЦикла;
		
		Таблица.Сортировать("НоменклатураНаименование Возр, СтатусПартии Возр, МоментВремени Возр, Ключ Возр");
		Таблица.Свернуть("Номенклатура, СтатусПартии, ДокументОприходования, ДокументОприходованияДата, НоменклатураНаименование");
		
		// От таблицы оставим только первые КоличествоСтрокЗаПроход, таким образом получим ограничение
		// обрабатываемого количества строк числом КоличествоСтрокЗаПроход и ограничение выбираемых из  
		// базы данных строк (не более КоличествоСтрокЗаПроход*МассивТаблиц.Количество())
		
		КоличествоЛишнихСтрокСнизу = Таблица.Количество()-КоличествоСтрокЗаПроход;
		
		Если КоличествоЛишнихСтрокСнизу>0 Тогда
			Для Сч=1 По КоличествоЛишнихСтрокСнизу Цикл
				Таблица.Удалить(Таблица[КоличествоСтрокЗаПроход]);
			КонецЦикла;
		КонецЕсли;
		
		КоличествоСтрок = Таблица.Количество();
		// Если строки кончились, прерываем цикл
		Если КоличествоСтрок = 0 Тогда
			Прервать;
		КонецЕсли;
		
		текСтатусПартии = Таблица[КоличествоСтрок-1].СтатусПартии;
		текНоменклатураНаименование = Таблица[КоличествоСтрок-1].НоменклатураНаименование;
		текДокументОприходования = Таблица[КоличествоСтрок-1].ДокументОприходования;
		текДокументОприходованияДата = Таблица[КоличествоСтрок-1].ДокументОприходованияДата;
		
		Таблица.Свернуть("Номенклатура, СтатусПартии, ДокументОприходования");
		
		// Корректировка списания по-средней
		СкорректироватьСписание(ДатаНач, ДатаКон, Таблица, Ссылка);

	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = КонецМесяца(Дата);
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры
